app/views/seasons/show.html.erb

SELECT "episodes".* FROM "episodes" WHERE "episodes"."season_id" = ?  [["season_id", 128272]]
---
<% @episodes.each do |episode| %>
    <p>Episode <%= episode.episode_number%>: <%= link_to episode.name, episode_path(episode) %><%= " - ✔️" if @watches.find{|watch| watch.episode_id == episode.id }%></p>