app/views/users/show.html.erb

SELECT COUNT(*) FROM "followings" WHERE "followings"."user_id" = ?  [["user_id", 2]]
---
      <p>Followers: <%= @user.followers.size%></p>
      <p>Following: <%= @user.followings.size%></p>

SELECT "views".* FROM "views" WHERE "views"."user_id" = ?  [["user_id", 2]]
SELECT "watches".* FROM "watches" WHERE "watches"."user_id" = ?  [["user_id", 2]]
---
      <ul>
      <% @user.views.each do |view| %>
          <li><%= link_to view.show.name, show_path(view.show) %></li>
          <% @user.watches.each do |watch| %>