app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "episode_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["episode_id", 1951792], ["comment", "Great episode"], ["created_at", "2019-10-24 23:05:05.156282"], ["updated_at", "2019-10-24 23:05:05.156282"]]
---
    def create
        if params[:comment][:comment] != ""
            @comment = Comment.create(comment_params)