app/controllers/episodes_controller.rb

    def show
        @episode = Episode.find(params[:id])
        @comments = @episode.comments
        @show = @episode.season.show
        @views = View.all
        @watch = Watch.find_or_create_by(user_id: session[:user_id], episode_id: @episode.id)
---
SELECT "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT ?  [["id", 1951792], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."episode_id" = ?  [["episode_id", 1951792]]
SELECT "seasons".* FROM "seasons" WHERE "seasons"."id" = ? LIMIT ?  [["id", 128272], ["LIMIT", 1]]
SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT ?  [["id", 1412], ["LIMIT", 1]]
INSERT INTO "watches" ("user_id", "episode_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["episode_id", 1951792], ["created_at", "2019-10-24 23:04:57.623595"], ["updated_at", "2019-10-24 23:04:57.623595"]]