app/controllers/followings_controller.rb

    def create
        Following.create!(user_id: session[:user_id],followed_user_id: params[:followee_id])
---
INSERT INTO "followings" ("user_id", "followed_user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["followed_user_id", 1], ["created_at", "2019-10-25 02:46:54.121291"], ["updated_at", "2019-10-25 02:46:54.121291"]]