app/controllers/seasons_controller.rb

SELECT "seasons".* FROM "seasons" WHERE "seasons"."id" = ? LIMIT ?  [["id", 128272], ["LIMIT", 1]]
SELECT "episodes".* FROM "episodes" WHERE "episodes"."season_id" = ?  [["season_id", 128272]]
UPDATE "seasons" SET "has_episodes_loaded" = ?, "updated_at" = ? WHERE "seasons"."id" = ?  [["has_episodes_loaded", 1], ["updated_at", "2019-10-24 23:03:56.402415"], ["id", 128272]]
SELECT "watches".* FROM "watches" WHERE "watches"."user_id" = ? AND "watches"."watched" = ?  [["user_id", 2], ["watched", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT ?  [["id", 1412], ["LIMIT", 1]]
SELECT "views".* FROM "views" WHERE "views"."show_id" = ?  [["show_id", 1412]]
---
    def show
        loaded = Season.find(params[:id])
        if loaded.has_episodes_loaded == false
            TMDBApi.all_the_episodes_info(params[:id]) if Season.find(params[:id])
            loaded.update(has_episodes_loaded: 1)
        end
        @season = Season.find(params[:id])
        @episodes = @season.episodes.sort_by{ |show| show.episode_number }.reverse
        @watches = Watch.all.where(user_id: session[:user_id],watched: true)
        @view = @season.show.views.find{|view| view.user_id == session[:user_id]}