app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT ?  [["user_name", "jeffjiang8"], ["LIMIT", 1]]
---
    def create
      user = User.find_by(user_name: params[:user][:user_name])