app/controllers/shows_controller.rb

SELECT "shows".* FROM "shows"
---
    def index
        @shows = if params[:q] != nil
            Show.search_shows(params[:q])
         else
            Show.all.sort_by{ |show| show.created_at }

SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT ?  [["id", 62286], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "views".* FROM "views" WHERE "views"."show_id" = ?  [["show_id", 62286]]
---
    def show
        in_database = Show.find(params[:id])
        TMDBApi.all_the_season_info(params[:id]) if !in_database.num_of_seasons
        @show = Show.find(params[:id])
        if @show.views.find{|view| view.user_id == session[:user_id]}
            @view = @show.views.find{|view| view.user_id == session[:user_id]}