app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("user_name", "first_name", "last_name", "age", "password_digest", "phone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def update
        @user.update(user_params)
---
UPDATE "users" SET "age" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["age", 5], ["password_digest", "$2a$12$3Uc/732jPjaP9FgaBI7wu.cDLkeLCCNIIbxFPos6/SLfc6cYHVO1."], ["updated_at", "2019-10-24 23:07:42.469454"], ["id", 2]]