app/controllers/views_controller.rb

    def create
        @view = View.create(view_params)
---
INSERT INTO "views" ("user_id", "show_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["show_id", 62286], ["status", "Watching"], ["created_at", "2019-10-24 23:08:09.629670"], ["updated_at", "2019-10-24 23:08:09.629670"]]

    def update
        @view = View.find(params[:id])
        @view.update(status: params[:view][:status])
---
SELECT "views".* FROM "views" WHERE "views"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "views" SET "status" = ?, "updated_at" = ? WHERE "views"."id" = ?  [["status", "Not Watching"], ["updated_at", "2019-10-24 23:09:32.931662"], ["id", 1]]