app/controllers/watches_controller.rb

    def update
        @watch = Watch.find(params[:id])
        @watch.update(watched: params[:watch][:watched])
---
SELECT "watches".* FROM "watches" WHERE "watches"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "watches" SET "watched" = ?, "updated_at" = ? WHERE "watches"."id" = ?  [["watched", 1], ["updated_at", "2020-02-17 21:41:59.827118"], ["id", 14]]