app/models/show.rb

    def self.check_out
        Show.all.sample(8)
---
SELECT "shows".* FROM "shows"