app/models/TMDBApi.rb

    def self.all_the_season_info(id)
        @show = Show.find(id)
        tmdb_api_key = ENV["TMDB_API_KEY"]

        open("https://api.themoviedb.org/3/tv/#{id}?api_key=#{tmdb_api_key}&language=en-US") do |publications|
            publications.read.each_line do |publication|
                @item = JSON.parse(publication)
                @show.update(num_of_seasons: @item["number_of_seasons"])
            end
        end

        @show.num_of_seasons.times do |season|
            @season_num = season + 1
            open("https://api.themoviedb.org/3/tv/#{id}/season/#{@season_num}?api_key=#{tmdb_api_key}&language=en-US") do |publications|
                data = []
                publications.read.each_line do |publication|
                    @item = JSON.parse(publication)
                    object = {
                        "id": @item["id"],
                        "show_id": @show.id,
                        "name": @item["name"],
                        "episode_count": @item["episodes"].count,
                        "overview": @item["overview"],
                        "season_number": @season_num
                    }
                    data << object
                end
                Season.create!(data)
---
SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT ?  [["id", 62286], ["LIMIT", 1]]
UPDATE "shows" SET "num_of_seasons" = ?, "updated_at" = ? WHERE "shows"."id" = ?  [["num_of_seasons", 5], ["updated_at", "2019-10-24 23:03:43.864060"], ["id", 62286]]
INSERT INTO "seasons" ("id", "show_id", "name", "episode_count", "created_at", "updated_at", "season_number") VALUES (?, ?, ?, ?, ?, ?, ?)  [["id", 104777], ["show_id", 60735], ["name", "Season 5"], ["episode_count", 22], ["created_at", "2019-10-25 03:18:56.770037"], ["updated_at", "2019-10-25 03:18:56.770037"], ["season_number", 5]]

    def self.all_the_episodes_info(id)
        @season = Season.find(id)
        tmdb_api_key = ENV["TMDB_API_KEY"]

        @season.episode_count.times do |episode|
            open("https://api.themoviedb.org/3/tv/#{@season.show_id}/season/#{@season.season_number}/episode/#{episode+1}?api_key=#{tmdb_api_key}&language=en-US") do |publications|
                data = []
                publications.read.each_line do |publication|
                    @item = JSON.parse(publication)
                    object = {
                        "id": @item["id"],
                        "season_id": @season.id,
                        "name": @item["name"],
                        "air_date": @item["air_date"],
                        "overview": @item["overview"],
                        "episode_number": episode+1

                    }
                    data << object
                end
                Episode.create!(data)
---
SELECT "seasons".* FROM "seasons" WHERE "seasons"."id" = ? LIMIT ?  [["id", 128272], ["LIMIT", 1]]
INSERT INTO "episodes" ("id", "season_id", "name", "overview", "air_date", "created_at", "updated_at", "episode_number") VALUES (?, ?, ?, ?, ?, ?, ?, ?)